# IsLightOn Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroupManager..::..IsLightOn Method
LightGroupManager Class See Also
---
Returns true if the given light is on for rendering the given view
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsLightOn(
	ElementId viewId,
	ElementId lightId
)
```

Visual Basic
---
```text
Public Function IsLightOn ( _
	viewId As ElementId, _
	lightId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsLightOn(
	ElementId^ viewId,
	ElementId^ lightId
)
```

# ### Parameters
viewId
    Type: Autodesk.Revit.DB..::..ElementId The Id of the view
lightId
    Type: Autodesk.Revit.DB..::..ElementId The Id of the light
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light instance |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace